Tekla Open API Reference for Tekla Structures 2025
ReinforcementBaseAttributes Properties
The ReinforcementBase.ReinforcementBaseAttributes type exposes the following members.
Properties
Name | Description
CustomPresentation
 Custom presentation GUID to be applied to the object type
HiddenLines
 The line type of the hidden lines of the reinforcement.
HideLinesHiddenByPart
 Defines whether lines hidden by parts should be hidden or not.
HideLinesHiddenByReinforcement
 Defines whether lines hidden by reinforcements should be hidden or not.
ReinforcementRepresentation
 The representation of reinforcing bars.
VisibleLines
 The line type of the visible lines of the reinforcement.
Top
See Also
Reference
ReinforcementBase.ReinforcementBaseAttributes Class
Tekla.Structures.Drawing Namespace